Revit 2026 API

# StructuralConnectionHandlerCreateGenericConnection Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static StructuralConnectionHandler CreateGenericConnection(
	Document document,
	IList<ElementId> idsToConnect
)
```
```vb
Public Shared Function CreateGenericConnection (
	document As Document,
	idsToConnect As IList(Of ElementId)
) As StructuralConnectionHandler
```
```cpp
public:
static StructuralConnectionHandler^ CreateGenericConnection(
	Document^ document,
	IList<ElementId^>^ idsToConnect
)
```
```fsharp
static member CreateGenericConnection :
        document : Document *
        idsToConnect : IList<ElementId> -> StructuralConnectionHandler
```

#### Parameters

document Document

idsToConnect IListElementId

#### Return Value

StructuralConnectionHandler

#### Reference

StructuralConnectionHandler Class

Autodesk.Revit.DB.Structure Namespace